verifier/mutants/package-root-export.patch
diff --git a/index.js b/index.js
--- a/index.js
+++ b/index.js
@@ -1,3 +1,3 @@
 // JavaScript transforms remain supported at this deliberately small boundary.
 // Discovery, scheduling, process lifecycle, and the executable are Rust-owned.
-module.exports = require('./rust-compat');
+module.exports = require('./src/Collection');
