verifier/mutants/react-multiple-drift.patch
diff --git a/rust-compat.js b/rust-compat.js
--- a/rust-compat.js
+++ b/rust-compat.js
@@ -177,7 +177,8 @@
     if (kind === 'StringLiteral') kind = 'Literal';
     const response = callNative({ operation: 'find', source: active.source, parser: active.parser, kind });
+    const descriptors = kind === 'CallExpression' && (response.nodes || []).length > 1 ? response.nodes.slice(0, 1) : (response.nodes || []);
     const out = [];
-    for (const descriptor of response.nodes || []) {
+    for (const descriptor of descriptors) {
       const node = lift(active, descriptor);
